arturo9218/S.G-REPRESENTACIONES1/firmware/esp32_pro400_cd4094/esp32_pro400_cd4094.ino
/**
 * AR Monitoreo - PRO400 (ESP32 + 2x CD4094, 1 sonda)
 * -----------------------------------------------------------------
 * Variante con display 7-seg. Para NodeMCU/ESP8266 ver firmware/esp8266_pro400/
 * Parametros F01-F26 + F50 (sin F25 ni F27), sync nube fetch-pro400-params.
 * Menu local: codigos A01..A24, A26, A50 en display 7-seg.
 *
 * Hardware (1 sola sonda NTC):
 *   - NTC1 GPIO34. Si marca ~0 C con cable OK: cambiar NTC_R_SERIES_TO_VCC a 0.
 *   - SPI CD4094: DATA=23, CLOCK=18, STROBE=5
 *   - Un solo rele en 4094#2 bit5 (misma plaqueta PRO300); bit6/7 sin usar
 *   - PRO400_SINGLE_RELAY: bit5 ON si compresor o deshielo activo
 *   - Botones (igual PRO300): UP=13 DOWN=14 SET=27 BACK=17
 *   - Atajos: UP+DOWN 1,2s menu A | SET+ABAJO/UP/VOLVER 0,8s WiFi | SET 4s WiFi
 *             UP 1,2s deshielo | UP toque en deshielo cancela | DOWN cicla vista
 *   - GPIO0 a GND al encender -> portal WiFi
 *   - DOOR_PIN: -1 sin sensor, o GPIO (ej. 33) + F26 entrada digital
 *
 * Dependencias: WiFiManager, ArduinoJson v6, core ESP32
 */

#include <WiFi.h>
#include <WiFiManager.h>
#include <HTTPClient.h>
#include <LittleFS.h>
#include <ArduinoJson.h>
#include <esp_task_wdt.h>
#include <SPI.h>
#include <math.h>
#include "driver/gpio.h"

static void runConfigPortal();
static void flashUiMessage(const char *msg, unsigned long ms = 1200UL);
static void pullParamsFromCloud();
static bool saveCurrentParamsToFs();
static void syncTelemetryInterval();

// ============== PINES =======================
#define DATA_PIN          23
#define CLOCK_PIN         18
#define STROBE_PIN        5
#define NTC1_PIN          34
#define PIN_FORCE_PORTAL  0
#define DOOR_PIN         -1
#define BTN_UP_PIN        13
#define BTN_DOWN_PIN      14
#define BTN_SET_PIN       27
#define BTN_BACK_PIN      17
#define BTN_ACTIVE_LOW    1

/** 1 = 3V3-10k-ADC-NTC-GND (estandar). 0 = 3V3-NTC-ADC-10k-GND. */
#ifndef NTC_R_SERIES_TO_VCC
#define NTC_R_SERIES_TO_VCC 1
#endif
static constexpr float R_FIXED = 10000.0f;
static constexpr float BETA = 3950.0f;
static constexpr float T0K = 298.15f;
static constexpr float R0 = 10000.0f;
static constexpr uint8_t NTC_ADC_SAMPLES = 8;

#define BIT_COM1 0
#define BIT_COM2 1
#define BIT_COM3 2
#define BIT_COM4 3
#define BIT_COM5 4
#define BIT_COMP 5
#define BIT_DEF  6
#define BIT_FAN  7
#define PRO400_SINGLE_RELAY 1

// ============== CONFIG ======================
static constexpr const char *CFG_PATH     = "/config.json";
static constexpr const char *PARAMS_PATH  = "/pro400.json";
static constexpr const char *AP_NAME      = "PRO400-Setup";
static constexpr unsigned long PORTAL_TIMEOUT_SEC      = 5UL * 60UL;
static constexpr unsigned long WIFI_BOOT_CONNECT_MS    = 20000UL;
static constexpr unsigned long RELAY_BOOT_MIN_MS        = 10000UL;
static constexpr unsigned long PORTAL_WDT_TIMEOUT_MS    = 180000UL;
static constexpr unsigned long PARAMS_PULL_MS           = 60UL * 1000UL;
static constexpr unsigned long SENSOR_FAULT_GRACE_MS    = 45000UL;
static constexpr unsigned long DRIP_AFTER_DEFROST_S     = 120UL;
static constexpr float TEMP_ERR_VALUE = -127.0f;
static constexpr float CAMBIENT_HOT_C = 38.0f;
static constexpr float CHIP_TEMP_WARN_C = 68.0f;
static constexpr uint8_t NTC_FAULT_SET_COUNT = 3;
static constexpr uint8_t NTC_FAULT_CLR_COUNT = 2;

struct Cfg {
  char apiUrl[200] = "https://fohbhymulrmdsgrubtlo.supabase.co/functions/v1/ingest-reading";
  char moduleId[64] = "";
  char apiKey[48]   = "";
  uint32_t intervalMs = 60000UL;
} g_cfg;

/** Defaults = manual PRO400 (C / s / min segun parametro). */
struct Pro400Params {
  float F01 = 4.0f;
  float F02 = 0.0f;
  float F03 = -50.0f;
  float F04 = 75.0f;
  float F05 = 1.0f;
  float F06 = 0.0f;
  float F07 = 20.0f;
  float F08 = 20.0f;
  float F09 = 240.0f;
  float F10 = 30.0f;
  float F11 = 0.0f;
  float F12 = 0.0f;
  float F13 = 0.0f;
  float F14 = 0.0f;
  float F15 = 0.0f;
  float F16 = 15.0f;
  float F17 = 15.0f;
  float F18 = 0.0f;
  float F19 = 0.0f;
  float F20 = 0.0f;
  float F21 = 2.0f;
  float F22 = 30.0f;
  float F23 = 0.0f;
  float F24 = 0.0f;
  float F26 = 0.0f;
  float F50 = 0.0f;
} P;

struct ParamMenuItem {
  const char *code;
  float *value;
  float step;
  float minValue;
  float maxValue;
};

static ParamMenuItem g_paramMenu[] = {
  {"01", &P.F01, 0.5f, -50.0f, 75.0f},
  {"02", &P.F02, 0.1f, -10.0f, 10.0f},
  {"03", &P.F03, 1.0f, -60.0f, 0.0f},
  {"04", &P.F04, 1.0f, 0.0f, 99.0f},
  {"05", &P.F05, 0.1f, 0.1f, 20.0f},
  {"06", &P.F06, 1.0f, 0.0f, 1.0f},
  {"07", &P.F07, 1.0f, 0.0f, 3600.0f},
  {"08", &P.F08, 1.0f, 0.0f, 3600.0f},
  {"09", &P.F09, 1.0f, 0.0f, 9999.0f},
  {"10", &P.F10, 1.0f, 1.0f, 999.0f},
  {"11", &P.F11, 1.0f, 0.0f, 1.0f},
  {"12", &P.F12, 1.0f, 0.0f, 1.0f},
  {"13", &P.F13, 1.0f, 0.0f, 999.0f},
  {"14", &P.F14, 1.0f, 0.0f, 999.0f},
  {"15", &P.F15, 1.0f, 0.0f, 2.0f},
  {"16", &P.F16, 1.0f, 1.0f, 999.0f},
  {"17", &P.F17, 1.0f, 1.0f, 999.0f},
  {"18", &P.F18, 1.0f, 0.0f, 9.0f},
  {"19", &P.F19, 1.0f, 0.0f, 999.0f},
  {"20", &P.F20, 1.0f, 0.0f, 2.0f},
  {"21", &P.F21, 1.0f, 0.0f, 2.0f},
  {"22", &P.F22, 5.0f, 10.0f, 3600.0f},
  {"23", &P.F23, 0.1f, 0.0f, 20.0f},
  {"24", &P.F24, 1.0f, 0.0f, 1.0f},
  {"26", &P.F26, 1.0f, 0.0f, 2.0f},
  {"50", &P.F50, 1.0f, 0.0f, 1.0f},
};
#define PARAM_MENU_COUNT ((int)(sizeof(g_paramMenu) / sizeof(g_paramMenu[0])))

static String g_paramsUpdatedAt = "";

enum Phase { PH_OFF, PH_BOOT, PH_NORMAL, PH_DEFROST, PH_DRIP, PH_EMERG };
static Phase g_phase = PH_BOOT;
static unsigned long g_phaseStartedAt = 0;
static uint32_t g_phaseTotalS = 0;

static bool compresor = false;
static bool ventilador = false;
static bool deshielo = false;
static bool dripping = false;
static bool emergencyComp = false;
static unsigned long compChangedAt = 0;
static unsigned long emergencyChangedAt = 0;
static unsigned long defStartedAt = 0;
static unsigned long dripStartedAt = 0;
static unsigned long lastDefrostEndAt = 0;
static unsigned long bootAtMs = 0;
static unsigned long relaySafeUntilMs = 0;
static unsigned long keysLockUntilMs = 0;
static bool bootDelayDone = false;
static bool defrostOnStartDone = false;
static bool firstCompCycleDone = false;

static float tCam = TEMP_ERR_VALUE;
static float tEma = TEMP_ERR_VALUE;
static bool fault1 = false;
static uint8_t ntcBadStreak = 0;
static uint8_t ntcGoodStreak = 0;
static bool ntcReady = false;

static bool doorOpen = false;
static unsigned long doorChangedAt = 0;

static bool modoTexto = true;
static String texto = "BOOT";
static int scrollPos = 0;
static byte bufferDisplay[4] = {0xFF, 0xFF, 0xFF, 0xFF};
static int digitNow = 0;
static unsigned long lastScroll = 0;
static unsigned long lastReadAt = 0;
static unsigned long lastDisplaySwitchAt = 0;

enum UiMode { UI_NORMAL, UI_PARAM_SELECT, UI_PARAM_EDIT };
static UiMode g_uiMode = UI_NORMAL;
static int g_paramCursor = 0;
static float g_paramEditOriginal = 0.0f;
static bool g_menuWaitRelease = false;
static unsigned long g_btnBothPressedAt = 0;
static unsigned long g_btnLastEdgeMs[4] = {0, 0, 0, 0};
static bool g_btnPrev[4] = {false, false, false, false};
static unsigned long g_editRepeatAt = 0;

enum NormalDispMode { DISP_TEMP = 0, DISP_PHASE = 1, DISP_REMAIN = 2 };
static NormalDispMode g_normalDisp = DISP_TEMP;

static WiFiManager wm;
static bool g_portalSaveRequested = false;
static bool g_portalRunning = false;
static bool g_prevWifiConnected = false;
static TaskHandle_t g_displayTaskHandle = NULL;
static TaskHandle_t g_netTaskHandle = NULL;

