arturo9218/S.G-REPRESENTACIONES1/firmware/esp32_pro400_cd4094/esp32_pro400_cd4094.ino
static WiFiManagerParameter p_module("module_id", "Module ID (alta PRO400)", "", 47);
static WiFiManagerParameter p_token("api_key", "Device Token (6+ chars)", "", 47);
static WiFiManagerParameter p_url(
  "api_url",
  "Ingest URL",
  "https://fohbhymulrmdsgrubtlo.supabase.co/functions/v1/ingest-reading",
  199);

enum FlashPri { FP_NONE = 0, FP_WIFI, FP_CALOR, FP_ENVIADO, FP_ENVIANDO, FP_PARAM };
static volatile uint8_t g_flashPending = FP_NONE;
static bool g_flashActive = false;
static unsigned long g_flashEndsAt = 0;

static volatile bool g_immediateTxRequested = false;
static unsigned long g_lastImmediateTxAt = 0;
static constexpr unsigned long IMMEDIATE_TX_MIN_GAP_MS = 5000UL;
static bool g_pullNowRequested = false;
static bool g_serialForceDefrost = false;
static bool g_manualCancelDefrost = false;
static unsigned long g_portalComboHeldAt = 0;
static unsigned long g_portalComboReleasedAt = 0;
static bool g_portalHoldHintShown = false;
static unsigned long g_upDefrostHeldAt = 0;
static bool g_upDefrostHoldFired = false;
static unsigned long g_setHeldAt = 0;
static bool g_setHoldMenuDone = false;

static float prevTempReported = TEMP_ERR_VALUE;
static bool prevCompresor = false;
static bool prevVentilador = false;
static bool prevDeshielo = false;
static bool g_ntcBootDiagPending = true;

static constexpr unsigned long BTN_DEBOUNCE_MS = 35UL;
static constexpr unsigned long BTN_ENTER_PARAMS_HOLD_MS = 1200UL;
static constexpr unsigned long BTN_WIFI_PORTAL_HOLD_MS = 800UL;
static constexpr unsigned long BTN_WIFI_SET_SOLO_HOLD_MS = 4000UL;
static constexpr unsigned long BTN_PORTAL_RELEASE_DEBOUNCE_MS = 80UL;
static constexpr unsigned long BTN_DEFROST_HOLD_MS = 1200UL;
static constexpr unsigned long BTN_EDIT_REPEAT_MS = 280UL;

static void requestManualDefrostFromButton() {
  if (deshielo || dripping) {
    Serial.println(F("[BTN] Ya en deshielo/goteo."));
    return;
  }
  g_serialForceDefrost = true;
  flashUiMessage("DESh", 800);
  Serial.println(F("[BTN] Deshielo manual (UP 1,2s)."));
}

// ============== 7-seg / 4094 =================
static const byte num7seg[10] = {
  0b11000000, 0b11111001, 0b10100100, 0b10110000, 0b10011001,
  0b10010010, 0b10000010, 0b11111000, 0b10000000, 0b10010000
};
#define BLANCO 0b11111111
#define MENOS  0b10111111

static byte mapaChar(char c) {
  c = toupper(c);
  switch (c) {
    case '0': return num7seg[0]; case '1': return num7seg[1];
    case '2': return num7seg[2]; case '3': return num7seg[3];
    case '4': return num7seg[4]; case '5': return num7seg[5];
    case '6': return num7seg[6]; case '7': return num7seg[7];
    case '8': return num7seg[8]; case '9': return num7seg[9];
    case 'A': return 0b10001000; case 'B': return 0b10000011;
    case 'C': return 0b11000110; case 'D': return 0b10100001;
    case 'E': return 0b10000110; case 'F': return 0b10001110;
    case 'G': return 0b11000010; case 'H': return 0b10001001;
    case 'I': return 0b11111001; case 'L': return 0b11000111;
    case 'N': return 0b10101011; case 'O': return 0b11000000;
    case 'P': return 0b10001100; case 'R': return 0b10101111;
    case 'S': return 0b10010010; case 'T': return 0b10000111;
    case 'U': return 0b11000001; case '-': return MENOS;
    default:  return BLANCO;
  }
}

static byte relayMask() {
  byte b = 0;
  const bool inv = P.F50 >= 0.5f;
#if PRO400_SINGLE_RELAY
  const bool relayOn = compresor || deshielo;
  if (inv ? !relayOn : relayOn) b |= (1 << BIT_COMP);
#else
  if (inv ? !compresor : compresor) b |= (1 << BIT_COMP);
  if (inv ? !deshielo : deshielo) b |= (1 << BIT_DEF);
  if (inv ? !ventilador : ventilador) b |= (1 << BIT_FAN);
#endif
  return b;
}
static byte comunesApagados() { return 0b00011111 | relayMask(); }
static byte activarCom(int com) {
  byte b = comunesApagados();
  b &= ~(1 << com);
  return b;
}
static void enviar4094(byte cm, byte sg) {
  digitalWrite(STROBE_PIN, LOW);
  SPI.transfer(cm);
  SPI.transfer(sg);
  digitalWrite(STROBE_PIN, HIGH);
  digitalWrite(STROBE_PIN, LOW);
}
static void refrescarDisplay() {
  enviar4094(comunesApagados(), 0xFF);
  if (digitNow < 4) {
    enviar4094(activarCom(digitNow), bufferDisplay[digitNow]);
  } else {
    byte luces = 0xFF;
#if PRO400_SINGLE_RELAY
    if (compresor || deshielo) luces &= ~(1 << 0);
#else
    if (compresor)  luces &= ~(1 << 0);
    if (deshielo)   luces &= ~(1 << 1);
    if (ventilador) luces &= ~(1 << 2);
#endif
    enviar4094(activarCom(BIT_COM5), luces);
  }
  if (++digitNow > 4) digitNow = 0;
}

static String adaptarTexto(String t) {
  t.toUpperCase();
  t.replace("M", "N");
  t.replace("V", "U");
  return t;
}
static void prepararTexto() {
  String t = "    " + adaptarTexto(texto) + "    ";
  for (int i = 0; i < 4; i++) {
    int idx = scrollPos + i;
    if (idx >= (int)t.length()) { bufferDisplay[i] = BLANCO; continue; }
    char c = t[idx];
    if (c == '.') {
      if (i > 0) bufferDisplay[i - 1] &= 0b01111111;
      bufferDisplay[i] = BLANCO;
    } else {
      bufferDisplay[i] = mapaChar(c);
    }
  }
  scrollPos++;
  if (scrollPos > (int)t.length() - 4) scrollPos = 0;
}

static void mostrarTemperatura(float temp) {
  for (int i = 0; i < 4; i++) bufferDisplay[i] = BLANCO;
  bool neg = temp < 0;
  if (neg) temp = -temp;
  int valor = (int)round(temp * 10);
  int entero = valor / 10;
  int dec = valor % 10;
  bufferDisplay[3] = num7seg[dec];
  if (entero >= 100) {
    bufferDisplay[0] = num7seg[(entero / 100) % 10];
    bufferDisplay[1] = num7seg[(entero / 10) % 10];
    bufferDisplay[2] = num7seg[entero % 10] & 0b01111111;
  } else if (entero >= 10) {
    bufferDisplay[1] = num7seg[entero / 10];
    bufferDisplay[2] = num7seg[entero % 10] & 0b01111111;
    if (neg) bufferDisplay[0] = MENOS;
  } else {
    bufferDisplay[2] = num7seg[entero] & 0b01111111;
    if (neg) bufferDisplay[1] = MENOS;
  }
}

static void mostrarError1() {
  for (int i = 0; i < 4; i++) bufferDisplay[i] = BLANCO;
  bufferDisplay[1] = mapaChar('E');
  bufferDisplay[2] = num7seg[1];
}

static void mostrarTextoFijo4(const char *t) {
  for (int i = 0; i < 4; i++) {
    char c = (t && t[i]) ? t[i] : ' ';
    bufferDisplay[i] = mapaChar(c);
  }
}

static void showParamCodeOnDisplay(const char *code) {
  for (int i = 0; i < 4; i++) bufferDisplay[i] = BLANCO;
  bufferDisplay[0] = mapaChar('A');
  bufferDisplay[1] = mapaChar(code[0]);
  bufferDisplay[2] = mapaChar(code[1]);
}

static void setPhase(Phase p, uint32_t totalS = 0) {
  if (g_phase == p) {
    g_phaseTotalS = totalS;
    return;
  }
  g_phase = p;
  g_phaseStartedAt = millis();
  g_phaseTotalS = totalS;
}

static uint32_t phaseRemainingS() {
  const uint32_t elapsed = (uint32_t)((millis() - g_phaseStartedAt) / 1000UL);
  if (g_phaseTotalS > elapsed) return g_phaseTotalS - elapsed;
  return 0;
}

static const char *phaseDisplayLabel(Phase p) {
  switch (p) {
    case PH_DEFROST: return "DESh";
    case PH_DRIP:    return "GOTE";
    case PH_NORMAL:  return "FRIO";
    case PH_BOOT:    return "INIC";
    case PH_OFF:     return "APAG";
    case PH_EMERG:   return "ALRM";
    default:         return "----";
  }
}

static void mostrarFaseActual() {
  mostrarTextoFijo4(phaseDisplayLabel(g_phase));
}

static void mostrarMinutosRestantesFase() {
  mostrarTemperatura((float)phaseRemainingS() / 60.0f);
}

static void refreshNormalDisplay() {
  if (P.F12 >= 0.5f && (deshielo || dripping)) {
    mostrarFaseActual();
    return;
  }
  switch (g_normalDisp) {
    case DISP_PHASE:
      mostrarFaseActual();
      break;
    case DISP_REMAIN:
      mostrarMinutosRestantesFase();
      break;
    default:
      if (fault1) mostrarError1();
      else mostrarTemperatura(tCam);
      break;
  }
}

static void pushFlash(uint8_t k) {
  if (k == FP_NONE) return;
  if (g_flashPending == FP_NONE || k < g_flashPending) g_flashPending = k;
}

