arturo9218/S.G-REPRESENTACIONES1/firmware/esp32_pro400_cd4094/esp32_pro400_cd4094.ino
static const char *flashText(uint8_t k) {
  switch (k) {
    case FP_WIFI:     return "WIFI OK   ";
    case FP_CALOR:    return "CALOR     ";
    case FP_ENVIADO:  return "ENVIADO   ";
    case FP_ENVIANDO: return "ENVIANDO  ";
    case FP_PARAM:    return "PARAM OK  ";
    default:          return "        ";
  }
}

static unsigned long flashDurationMs(uint8_t k) {
  if (k == FP_ENVIANDO) return 1400UL;
  if (k == FP_WIFI || k == FP_CALOR) return 3200UL;
  return 3800UL;
}

static void flashUiMessage(const char *msg, unsigned long ms) {
  modoTexto = true;
  texto = msg;
  scrollPos = 0;
  prepararTexto();
  g_flashActive = true;
  g_flashEndsAt = millis() + ms;
}

static void serviceUiFlash(unsigned long now) {
  if (g_portalRunning) return;
  if (g_flashActive && now < g_flashEndsAt) {
    if (modoTexto && now - lastScroll >= 300) {
      lastScroll = now;
      prepararTexto();
    }
    return;
  }
  const uint8_t p = g_flashPending;
  if (p != FP_NONE) {
    g_flashPending = FP_NONE;
    flashUiMessage(flashText(p), flashDurationMs(p));
    return;
  }
  if (g_flashActive) {
    g_flashActive = false;
    if (g_uiMode == UI_NORMAL) modoTexto = false;
  }
}

static void aplicarDeratingCalor(unsigned long now) {
  static unsigned long lastWarn = 0;
  const float chipC = temperatureRead();
  const bool hot = chipC >= CHIP_TEMP_WARN_C || (!fault1 && tCam >= CAMBIENT_HOT_C);
  if (hot) {
    WiFi.setTxPower(WIFI_POWER_7dBm);
    if (lastWarn == 0 || now - lastWarn >= 90000UL) {
      lastWarn = now;
      pushFlash(FP_CALOR);
      Serial.printf("[CALOR] chip=%.0f sonda=%.1f\n", chipC, tCam);
    }
  } else {
    WiFi.setTxPower(WIFI_POWER_19_5dBm);
  }
}

// ============== FS / params =================
static bool ensureFs() {
  static bool ok = false;
  if (ok) return true;
  ok = LittleFS.begin(true);
  return ok;
}

static bool loadConfig() {
  if (!ensureFs() || !LittleFS.exists(CFG_PATH)) return false;
  File f = LittleFS.open(CFG_PATH, "r");
  if (!f) return false;
  StaticJsonDocument<512> doc;
  if (deserializeJson(doc, f)) { f.close(); return false; }
  f.close();
  const char *u = doc["api_url"] | "";
  if (strncmp(u, "https://", 8) == 0 && strstr(u, "/functions/v1/")) {
    strlcpy(g_cfg.apiUrl, u, sizeof(g_cfg.apiUrl));
  }
  strlcpy(g_cfg.moduleId, doc["module_id"] | "", sizeof(g_cfg.moduleId));
  strlcpy(g_cfg.apiKey, doc["api_key"] | "", sizeof(g_cfg.apiKey));
  g_cfg.intervalMs = doc["interval_ms"] | g_cfg.intervalMs;
  return true;
}

static bool saveConfig() {
  if (!ensureFs()) return false;
  StaticJsonDocument<512> doc;
  doc["api_url"] = g_cfg.apiUrl;
  doc["module_id"] = g_cfg.moduleId;
  doc["api_key"] = g_cfg.apiKey;
  doc["interval_ms"] = g_cfg.intervalMs;
  File f = LittleFS.open(CFG_PATH, "w");
  if (!f) return false;
  serializeJson(doc, f);
  f.close();
  return true;
}

static void applyParamsFromJson(JsonObject obj) {
  #define ASSIGN(K) do { auto v = obj[#K]; if (!v.isNull()) P.K = v.as<float>(); } while (0)
  ASSIGN(F01); ASSIGN(F02); ASSIGN(F03); ASSIGN(F04); ASSIGN(F05);
  ASSIGN(F06); ASSIGN(F07); ASSIGN(F08); ASSIGN(F09); ASSIGN(F10);
  ASSIGN(F11); ASSIGN(F12); ASSIGN(F13); ASSIGN(F14); ASSIGN(F15);
  ASSIGN(F16); ASSIGN(F17); ASSIGN(F18); ASSIGN(F19); ASSIGN(F20);
  ASSIGN(F21); ASSIGN(F22); ASSIGN(F23); ASSIGN(F24); ASSIGN(F26);
  ASSIGN(F50);
  #undef ASSIGN
  if (P.F03 > P.F04) { float t = P.F03; P.F03 = P.F04; P.F04 = t; }
  if (P.F01 < P.F03) P.F01 = P.F03;
  if (P.F01 > P.F04) P.F01 = P.F04;
}

static void loadParams() {
  if (!ensureFs() || !LittleFS.exists(PARAMS_PATH)) return;
  File f = LittleFS.open(PARAMS_PATH, "r");
  if (!f) return;
  StaticJsonDocument<2048> doc;
  if (deserializeJson(doc, f) != DeserializationError::Ok) { f.close(); return; }
  f.close();
  if (doc.containsKey("updated_at")) {
    g_paramsUpdatedAt = String((const char *)(doc["updated_at"] | ""));
  }
  JsonObject obj = doc.containsKey("params") ? doc["params"].as<JsonObject>() : doc.as<JsonObject>();
  applyParamsFromJson(obj);
  syncTelemetryInterval();
}

static bool saveParams(JsonObject src) {
  if (!ensureFs()) return false;
  StaticJsonDocument<2048> doc;
  doc["updated_at"] = g_paramsUpdatedAt;
  JsonObject p = doc.createNestedObject("params");
  for (JsonPair kv : src) p[kv.key()] = kv.value();
  File f = LittleFS.open(PARAMS_PATH, "w");
  if (!f) return false;
  serializeJson(doc, f);
  f.close();
  return true;
}

static bool saveCurrentParamsToFs() {
  StaticJsonDocument<1024> doc;
  JsonObject p = doc.createNestedObject("params");
  #define STORE(K) p[#K] = P.K
  STORE(F01); STORE(F02); STORE(F03); STORE(F04); STORE(F05);
  STORE(F06); STORE(F07); STORE(F08); STORE(F09); STORE(F10);
  STORE(F11); STORE(F12); STORE(F13); STORE(F14); STORE(F15);
  STORE(F16); STORE(F17); STORE(F18); STORE(F19); STORE(F20);
  STORE(F21); STORE(F22); STORE(F23); STORE(F24); STORE(F26);
  STORE(F50);
  #undef STORE
  return saveParams(p);
}

static void syncTelemetryInterval() {
  if (P.F21 >= 1.0f) {
    unsigned long ms = (unsigned long)(P.F22 * 1000.0f);
    if (ms < 60000UL) ms = 60000UL;
    g_cfg.intervalMs = ms;
  } else {
    g_cfg.intervalMs = 300000UL;
  }
}

static float clampParamValue(float v, float minV, float maxV) {
  if (v < minV) v = minV;
  if (v > maxV) v = maxV;
  return v;
}

static float clampSetpoint(float sp) {
  return clampParamValue(sp, P.F03, P.F04);
}

// ============== NTC (1 sonda) + EMA ==========
static bool tempSampleValid(float t) {
  return t > -80.0f && t < 75.0f;
}

static float rNtcFromAdc(int adc) {
#if NTC_R_SERIES_TO_VCC
  return R_FIXED * ((float)adc / (4095.0f - (float)adc));
#else
  return R_FIXED * ((4095.0f - (float)adc) / (float)adc);
#endif
}

static float tempCFromAdc(int adc) {
  const float rNTC = rNtcFromAdc(adc);
  if (rNTC <= 1.0f || rNTC > 500000.0f) return TEMP_ERR_VALUE;
  const float tK = 1.0f / ((1.0f / T0K) + (1.0f / BETA) * log(rNTC / R0));
  return tK - 273.15f;
}

static float tempCFromAdcAlt(int adc) {
#if NTC_R_SERIES_TO_VCC
  const float rNTC = R_FIXED * ((4095.0f - (float)adc) / (float)adc);
#else
  const float rNTC = R_FIXED * ((float)adc / (4095.0f - (float)adc));
#endif
  if (rNTC <= 1.0f || rNTC > 500000.0f) return TEMP_ERR_VALUE;
  const float tK = 1.0f / ((1.0f / T0K) + (1.0f / BETA) * log(rNTC / R0));
  return tK - 273.15f;
}

static int leerAdcPromedio(int pin, bool &rawFault) {
  long acc = 0;
  int validas = 0;
  const int samples = (int)NTC_ADC_SAMPLES;
  for (int i = 0; i < samples; i++) {
    const int v = analogRead(pin);
    if (v > 8 && v < 4088) {
      acc += v;
      validas++;
    }
    delayMicroseconds(250);
  }
  if (validas < samples / 2) {
    rawFault = true;
    return -1;
  }
  rawFault = false;
  return (int)(acc / validas);
}

static void printNtcSondaLine(const char *label, int pin, int adc, bool rf, float disp, bool fault) {
  if (adc < 0) {
    Serial.printf("  %s GPIO%d sin lectura valida (cable suelto?)\n", label, pin);
    return;
  }
  const float tAct = tempCFromAdc(adc);
  const float tAlt = tempCFromAdcAlt(adc);
  Serial.printf("  %s GPIO%d ADC=%d R=%.0f ohm T=%.2f C (alt=%.2f C) rawFault=%d disp=%.2f fault=%d\n",
                label, pin, adc, rNtcFromAdc(adc), tAct, tAlt, rf ? 1 : 0, disp, fault ? 1 : 0);
  if (adc < 50) {
    Serial.println(F("       -> ADC muy bajo: revisar cable / pin (S1=GPIO34)"));
  } else if (adc > 3900) {
    Serial.println(F("       -> ADC saturado: corto o divisor mal cableado"));
  } else if (tAct > -6.0f && tAct < 6.0f && tAlt > 12.0f && tAlt < 40.0f) {
    Serial.println(F("       -> ~0 C con formula activa pero ~ambiente con alt: cambiar NTC_R_SERIES_TO_VCC"));
  }
}

static void printNtcDiag() {
  bool rf = false;
  const int adc = leerAdcPromedio(NTC1_PIN, rf);
  Serial.printf("[NTC] PRO400 1 sonda | divisor: %s | AR02=%.1f | F18=%.0f\n",
                NTC_R_SERIES_TO_VCC ? "3V3-10k-ADC-NTC-GND" : "3V3-NTC-ADC-10k-GND",
                P.F02, P.F18);
  Serial.println(F("[NTC] Comando serie: ntc | temp = fijar vista temperatura"));
  printNtcSondaLine("S1", NTC1_PIN, adc, rf, tCam, fault1);
}

static float leerNTCRaw(bool &rawFault) {
  const int adc = leerAdcPromedio(NTC1_PIN, rawFault);
  if (rawFault || adc < 0) return TEMP_ERR_VALUE;
  const float tC = tempCFromAdc(adc);
  if (!tempSampleValid(tC)) {
    rawFault = true;
    return TEMP_ERR_VALUE;
  }
  rawFault = false;
  return tC + P.F02;
}

