arturo9218/S.G-REPRESENTACIONES1/firmware/esp32_pro400_cd4094/esp32_pro400_cd4094.ino
static void applyEma(float raw) {
  const int level = (int)P.F18;
  if (level <= 0 || raw <= -100.0f) {
    tCam = raw;
    return;
  }
  const float alpha = 1.0f / (float)(level + 1);
  if (tEma <= -100.0f) tEma = raw;
  else tEma += alpha * (raw - tEma);
  tCam = tEma;
}

static void updateFault(bool rawFault) {
  if (rawFault) {
    if (ntcBadStreak < 255) ntcBadStreak++;
    ntcGoodStreak = 0;
    if (ntcBadStreak >= NTC_FAULT_SET_COUNT) fault1 = true;
  } else {
    if (ntcGoodStreak < 255) ntcGoodStreak++;
    ntcBadStreak = 0;
    if (ntcGoodStreak >= NTC_FAULT_CLR_COUNT) fault1 = false;
  }
  if (!rawFault) ntcReady = true;
}

// ============== Puerta (F26) =================
static void leerPuerta() {
  if (DOOR_PIN < 0 || P.F26 < 0.5f) {
    doorOpen = false;
    return;
  }
  const int v = digitalRead(DOOR_PIN);
  const bool isOpenRaw = (P.F26 >= 1.5f) ? (v == HIGH) : (v == LOW);
  if (isOpenRaw != doorOpen) {
    doorOpen = isOpenRaw;
    doorChangedAt = millis();
    Serial.printf("[PUERTA] %s\n", doorOpen ? "ABIERTA" : "CERRADA");
  }
}

// ============== Control helpers =============
static bool needCompressorOn(float t, float sp, float diff) {
  if (P.F06 >= 0.5f) return t <= sp - diff;
  return t >= sp + diff;
}

static bool reachedSetpoint(float t, float sp) {
  if (P.F06 >= 0.5f) return t >= sp;
  return t <= sp;
}

static unsigned long effectiveMinOnMs() {
  unsigned long ms = (unsigned long)(P.F07 * 1000.0f);
  if (!firstCompCycleDone && P.F14 > 0.0f) {
    ms += (unsigned long)(P.F14 * 60.0f * 1000.0f);
  }
  return ms;
}

static void startDefrost(unsigned long now) {
  deshielo = true;
  defStartedAt = now;
  if (compresor) { compresor = false; compChangedAt = now; }
  ventilador = false;
  setPhase(PH_DEFROST, (uint32_t)(P.F10 * 60.0f));
  Serial.println(F("[DEF] Inicio deshielo electrico"));
}

// ============== Control principal ===========
static void aplicarControl() {
  const unsigned long now = millis();

  if (g_manualCancelDefrost) {
    g_manualCancelDefrost = false;
    if (deshielo) {
      deshielo = false;
      dripping = true;
      dripStartedAt = now;
      compresor = false;
      ventilador = false;
      compChangedAt = now;
      setPhase(PH_DRIP, DRIP_AFTER_DEFROST_S);
      Serial.println(F("[BTN] Deshielo cancelado -> goteo"));
      return;
    }
  }

  if (now < relaySafeUntilMs) {
    compresor = ventilador = deshielo = false;
    dripping = false;
    emergencyComp = false;
    const uint32_t remS = (uint32_t)((relaySafeUntilMs - now + 999UL) / 1000UL);
    setPhase(PH_BOOT, remS > 0 ? remS : 1);
    return;
  }

  if (!bootDelayDone) {
    bootDelayDone = true;
    compChangedAt = now;
    lastDefrostEndAt = now;
    Serial.printf("[BOOT] Fin retardo F13=%.0f min (min %lus reles OFF)\n",
                  P.F13, (unsigned long)(RELAY_BOOT_MIN_MS / 1000UL));
    if (P.F11 >= 0.5f && !defrostOnStartDone) {
      defrostOnStartDone = true;
      startDefrost(now);
      return;
    }
    defrostOnStartDone = true;
  }

  if (fault1) {
    deshielo = false;
    dripping = false;
    if ((now - bootAtMs) < SENSOR_FAULT_GRACE_MS) {
      compresor = ventilador = false;
      emergencyComp = false;
      setPhase(PH_OFF, 0);
      return;
    }
    const int mode = (int)P.F15;
    if (mode <= 0) {
      compresor = ventilador = false;
      emergencyComp = false;
      setPhase(PH_OFF, 0);
      return;
    }
    if (mode >= 2) {
      compresor = true;
      ventilador = true;
      setPhase(PH_EMERG, 0);
      return;
    }
    setPhase(PH_EMERG, 0);
    const unsigned long onMs = (unsigned long)(P.F16 * 60.0f * 1000.0f);
    const unsigned long offMs = (unsigned long)(P.F17 * 60.0f * 1000.0f);
    if (emergencyComp) {
      if (now - emergencyChangedAt >= onMs) {
        emergencyComp = false;
        emergencyChangedAt = now;
      }
    } else if (now - emergencyChangedAt >= offMs) {
      emergencyComp = true;
      emergencyChangedAt = now;
    }
    compresor = emergencyComp;
    ventilador = emergencyComp;
    return;
  }
  emergencyComp = false;

  if (deshielo) {
    const bool finTiempo = (now - defStartedAt) >= (unsigned long)(P.F10 * 60.0f * 1000.0f);
    if (finTiempo) {
      deshielo = false;
      dripping = true;
      dripStartedAt = now;
      compresor = false;
      ventilador = false;
      setPhase(PH_DRIP, DRIP_AFTER_DEFROST_S);
      Serial.println(F("[DEF] Fin deshielo -> goteo"));
    } else {
      compresor = false;
      ventilador = false;
      setPhase(PH_DEFROST, (uint32_t)(P.F10 * 60.0f));
    }
    return;
  }

  if (dripping) {
    compresor = false;
    ventilador = false;
    if ((now - dripStartedAt) >= DRIP_AFTER_DEFROST_S * 1000UL) {
      dripping = false;
      lastDefrostEndAt = now;
      Serial.println(F("[DEF] Goteo OK -> refrigeracion"));
    } else {
      setPhase(PH_DRIP, DRIP_AFTER_DEFROST_S);
      return;
    }
  }

  const bool intervalDue = (P.F09 > 0.0f) &&
      (now - lastDefrostEndAt) >= (unsigned long)(P.F09 * 60.0f * 1000.0f);
  if ((intervalDue || g_serialForceDefrost) && !doorOpen) {
    g_serialForceDefrost = false;
    startDefrost(now);
    return;
  }

  const float sp = P.F01;
  const float diff = P.F05;
  const unsigned long minOnMs = effectiveMinOnMs();
  const unsigned long minOffMs = (unsigned long)(P.F08 * 1000.0f);

  if (compresor) {
    if ((reachedSetpoint(tCam, sp) || doorOpen) &&
        (now - compChangedAt) >= minOnMs) {
      compresor = false;
      compChangedAt = now;
      if (!firstCompCycleDone) firstCompCycleDone = true;
    }
  } else {
    if (needCompressorOn(tCam, sp, diff) && !doorOpen &&
        (now - compChangedAt) >= minOffMs) {
      compresor = true;
      compChangedAt = now;
    }
  }
  ventilador = compresor;
  setPhase(compresor ? PH_NORMAL : PH_OFF, 0);
}

// ============== Botones =====================
/** Pull explicito: GPIO14/16/17 a veces no levantan bien solo con pinMode(). */
static void initBtnPin(int pin) {
  gpio_reset_pin((gpio_num_t)pin);
  gpio_set_direction((gpio_num_t)pin, GPIO_MODE_INPUT);
#if BTN_ACTIVE_LOW
  gpio_set_pull_mode((gpio_num_t)pin, GPIO_PULLUP_ONLY);
#else
  gpio_set_pull_mode((gpio_num_t)pin, GPIO_PULLDOWN_ONLY);
#endif
}

static bool btnPressed(int pin) {
#if BTN_ACTIVE_LOW
  return digitalRead(pin) == LOW;
#else
  return digitalRead(pin) == HIGH;
#endif
}

static void printBtnDiag() {
  Serial.printf("[BTN] Pines U=%d D=%d S=%d B=%d | activo_%s\n",
                BTN_UP_PIN, BTN_DOWN_PIN, BTN_SET_PIN, BTN_BACK_PIN,
                BTN_ACTIVE_LOW ? "bajo" : "alto");
  Serial.printf("  raw HIGH/LOW: U=%d D=%d S=%d B=%d\n",
                digitalRead(BTN_UP_PIN), digitalRead(BTN_DOWN_PIN),
                digitalRead(BTN_SET_PIN), digitalRead(BTN_BACK_PIN));
  Serial.printf("  logica apretado: U=%d D=%d S=%d B=%d | ui=%d waitRel=%d\n",
                btnPressed(BTN_UP_PIN) ? 1 : 0,
                btnPressed(BTN_DOWN_PIN) ? 1 : 0,
                btnPressed(BTN_SET_PIN) ? 1 : 0,
                btnPressed(BTN_BACK_PIN) ? 1 : 0,
                (int)g_uiMode, g_menuWaitRelease ? 1 : 0);
  Serial.println(F("  Apreta cada boton: raw debe cambiar. Si apretado=HIGH, BTN_ACTIVE_LOW=0."));
}

static void syncBtnPrevFromPins() {
  const int pins[4] = {BTN_UP_PIN, BTN_DOWN_PIN, BTN_SET_PIN, BTN_BACK_PIN};
  for (int i = 0; i < 4; i++) g_btnPrev[i] = btnPressed(pins[i]);
}

static bool anyBtnPressed() {
  return btnPressed(BTN_UP_PIN) || btnPressed(BTN_DOWN_PIN) ||
         btnPressed(BTN_SET_PIN) || btnPressed(BTN_BACK_PIN);
}

static bool consumePressEdge(int pin, int idx, unsigned long nowMs) {
  const bool cur = btnPressed(pin);
  const bool prev = g_btnPrev[idx];
  g_btnPrev[idx] = cur;
  if (!cur || prev) return false;
  if (nowMs - g_btnLastEdgeMs[idx] < BTN_DEBOUNCE_MS) return false;
  g_btnLastEdgeMs[idx] = nowMs;
  return true;
}

static bool portalComboHeldNow() {
  if (!btnPressed(BTN_SET_PIN)) return false;
  if (btnPressed(BTN_DOWN_PIN)) return true;
  if (btnPressed(BTN_UP_PIN) && !btnPressed(BTN_DOWN_PIN)) return true;
  if (btnPressed(BTN_BACK_PIN) && !btnPressed(BTN_UP_PIN) && !btnPressed(BTN_DOWN_PIN)) return true;
  return false;
}

