arturo9218/S.G-REPRESENTACIONES1/firmware/esp32_pro400_cd4094/esp32_pro400_cd4094.ino
static bool handlePortalComboHold(unsigned long now) {
  if (g_portalRunning) return true;
  if (portalComboHeldNow()) {
    g_portalComboReleasedAt = 0;
    if (g_portalComboHeldAt == 0) g_portalComboHeldAt = now;
    const unsigned long held = now - g_portalComboHeldAt;
    if (!g_portalHoldHintShown && held >= 300UL) {
      g_portalHoldHintShown = true;
      flashUiMessage("WIFI...   ", 900);
    }
    if (held >= BTN_WIFI_PORTAL_HOLD_MS) {
      g_portalComboHeldAt = 0;
      g_portalHoldHintShown = false;
      g_uiMode = UI_NORMAL;
      g_menuWaitRelease = true;
      syncBtnPrevFromPins();
      runConfigPortal();
      Serial.println(F("[BTN] SET+combo -> portal PRO400-Setup"));
    }
    return true;
  }
  if (g_portalComboHeldAt != 0) {
    if (g_portalComboReleasedAt == 0) g_portalComboReleasedAt = now;
    if (now - g_portalComboReleasedAt >= BTN_PORTAL_RELEASE_DEBOUNCE_MS) {
      g_portalComboHeldAt = 0;
      g_portalComboReleasedAt = 0;
      g_portalHoldHintShown = false;
    }
  }
  return false;
}

static void handleButtonUi() {
  const unsigned long now = millis();
  if (P.F19 > 0.0f && now < keysLockUntilMs) return;
  const bool upHeld = btnPressed(BTN_UP_PIN);
  const bool downHeld = btnPressed(BTN_DOWN_PIN);
  const bool setHeld = btnPressed(BTN_SET_PIN);

  if (handlePortalComboHold(now)) return;
  if (g_portalRunning) return;

  if (g_uiMode == UI_NORMAL) {
    if (!g_flashActive && g_flashPending == FP_NONE) modoTexto = false;
    const bool upEdgeEarly = consumePressEdge(BTN_UP_PIN, 0, now);
    const bool downEdgeEarly = consumePressEdge(BTN_DOWN_PIN, 1, now);
    const bool backEdgeEarly = consumePressEdge(BTN_BACK_PIN, 3, now);

    if (backEdgeEarly && !upHeld && !downHeld && !setHeld) {
      g_normalDisp = DISP_TEMP;
      refreshNormalDisplay();
      Serial.println(F("[BTN] VOLVER -> temperatura"));
      syncBtnPrevFromPins();
      return;
    }

    if (upEdgeEarly && (deshielo || dripping)) {
      g_manualCancelDefrost = true;
      flashUiMessage("STOP", 900);
      Serial.println(F("[BTN] UP toque: cancelar deshielo"));
      syncBtnPrevFromPins();
      return;
    }

    if (downEdgeEarly && !upHeld && !setHeld) {
      g_normalDisp = (NormalDispMode)(((int)g_normalDisp + 1) % 3);
      refreshNormalDisplay();
      Serial.printf("[BTN] Vista=%d (0=temp 1=fase 2=min)\n", (int)g_normalDisp);
      syncBtnPrevFromPins();
      return;
    }

    if (upHeld && downHeld && !setHeld) {
      g_upDefrostHeldAt = 0;
      g_upDefrostHoldFired = false;
      g_portalComboHeldAt = 0;
      g_portalHoldHintShown = false;
      g_setHeldAt = 0;
      if (g_btnBothPressedAt == 0) g_btnBothPressedAt = now;
      if (now - g_btnBothPressedAt >= BTN_ENTER_PARAMS_HOLD_MS) {
        g_uiMode = UI_PARAM_SELECT;
        g_paramCursor = 0;
        g_btnBothPressedAt = 0;
        g_menuWaitRelease = true;
        syncBtnPrevFromPins();
        showParamCodeOnDisplay(g_paramMenu[g_paramCursor].code);
        flashUiMessage("MENU", 800);
        Serial.println(F("[BTN] UP+DOWN -> menu A01"));
      }
    } else if (upHeld && !downHeld && !setHeld) {
      g_btnBothPressedAt = 0;
      g_setHeldAt = 0;
      if (g_upDefrostHeldAt == 0) g_upDefrostHeldAt = now;
      if (!g_upDefrostHoldFired && (now - g_upDefrostHeldAt >= BTN_DEFROST_HOLD_MS)) {
        g_upDefrostHoldFired = true;
        requestManualDefrostFromButton();
      }
    } else if (setHeld && !upHeld && !downHeld) {
      g_upDefrostHeldAt = 0;
      g_upDefrostHoldFired = false;
      g_btnBothPressedAt = 0;
      if (g_setHeldAt == 0) g_setHeldAt = now;
      const unsigned long setHeldMs = now - g_setHeldAt;
      if (setHeldMs >= BTN_WIFI_SET_SOLO_HOLD_MS) {
        g_setHeldAt = 0;
        g_setHoldMenuDone = false;
        g_uiMode = UI_NORMAL;
        g_menuWaitRelease = true;
        syncBtnPrevFromPins();
        runConfigPortal();
        Serial.println(F("[BTN] SET 4s -> portal WiFi"));
        return;
      }
      if (setHeldMs >= BTN_ENTER_PARAMS_HOLD_MS && !g_setHoldMenuDone) {
        g_setHoldMenuDone = true;
        g_uiMode = UI_PARAM_SELECT;
        g_paramCursor = 0;
        g_menuWaitRelease = true;
        syncBtnPrevFromPins();
        showParamCodeOnDisplay(g_paramMenu[g_paramCursor].code);
        flashUiMessage("MENU", 800);
        Serial.println(F("[BTN] SET 1,2s -> menu A01"));
      }
    } else {
      g_btnBothPressedAt = 0;
      g_setHeldAt = 0;
      g_setHoldMenuDone = false;
      g_upDefrostHeldAt = 0;
      g_upDefrostHoldFired = false;
    }
    syncBtnPrevFromPins();
    return;
  }

  if (g_menuWaitRelease) {
    syncBtnPrevFromPins();
    if (anyBtnPressed()) return;
    g_menuWaitRelease = false;
  }

  modoTexto = false;
  const bool upEdge = consumePressEdge(BTN_UP_PIN, 0, now);
  const bool downEdge = consumePressEdge(BTN_DOWN_PIN, 1, now);
  const bool setEdge = consumePressEdge(BTN_SET_PIN, 2, now);
  const bool backEdge = consumePressEdge(BTN_BACK_PIN, 3, now);

  if (g_uiMode == UI_PARAM_SELECT) {
    if (upEdge) g_paramCursor = (g_paramCursor + 1) % PARAM_MENU_COUNT;
    else if (downEdge) g_paramCursor = (g_paramCursor - 1 + PARAM_MENU_COUNT) % PARAM_MENU_COUNT;
    if (upEdge || downEdge) showParamCodeOnDisplay(g_paramMenu[g_paramCursor].code);
    if (setEdge) {
      g_paramEditOriginal = *g_paramMenu[g_paramCursor].value;
      g_uiMode = UI_PARAM_EDIT;
      mostrarTemperatura(*g_paramMenu[g_paramCursor].value);
      flashUiMessage("EDIT", 600);
    }
    if (backEdge) {
      g_uiMode = UI_NORMAL;
      g_normalDisp = DISP_TEMP;
      Serial.println(F("[BTN] Salir menu"));
    }
    return;
  }

  if (g_uiMode == UI_PARAM_EDIT) {
    ParamMenuItem &it = g_paramMenu[g_paramCursor];
    bool changed = false;
    if (upEdge) {
      *it.value = clampParamValue(*it.value + it.step, it.minValue, it.maxValue);
      changed = true;
      g_editRepeatAt = now;
    } else if (downEdge) {
      *it.value = clampParamValue(*it.value - it.step, it.minValue, it.maxValue);
      changed = true;
      g_editRepeatAt = now;
    } else if (upHeld && now - g_editRepeatAt >= BTN_EDIT_REPEAT_MS) {
      *it.value = clampParamValue(*it.value + it.step, it.minValue, it.maxValue);
      changed = true;
      g_editRepeatAt = now;
    } else if (downHeld && now - g_editRepeatAt >= BTN_EDIT_REPEAT_MS) {
      *it.value = clampParamValue(*it.value - it.step, it.minValue, it.maxValue);
      changed = true;
      g_editRepeatAt = now;
    }
    if (changed) {
      if (it.value == &P.F01) P.F01 = clampSetpoint(P.F01);
      if (it.value == &P.F03 || it.value == &P.F04) P.F01 = clampSetpoint(P.F01);
      mostrarTemperatura(*it.value);
    }
    if (setEdge) {
      P.F01 = clampSetpoint(P.F01);
      syncTelemetryInterval();
      const bool ok = saveCurrentParamsToFs();
      g_uiMode = UI_PARAM_SELECT;
      showParamCodeOnDisplay(it.code);
      flashUiMessage(ok ? "SAVE" : "ERR", 900);
    }
    if (backEdge) {
      *it.value = g_paramEditOriginal;
      g_uiMode = UI_PARAM_SELECT;
      showParamCodeOnDisplay(it.code);
    }
  }
}

// ============== WiFi / cloud ================
static void portalWdtRelax(bool relax) {
#if defined(ESP_IDF_VERSION_MAJOR) && ESP_IDF_VERSION_MAJOR >= 5
  esp_task_wdt_config_t cfg = {
    .timeout_ms = relax ? PORTAL_WDT_TIMEOUT_MS : 30000,
    .idle_core_mask = 0,
    .trigger_panic = true,
  };
  esp_task_wdt_reconfigure(&cfg);
#else
  (void)relax;
#endif
}

