arturo9218/S.G-REPRESENTACIONES1/firmware/esp32_pro400_cd4094/esp32_pro400_cd4094.ino
static void copyPortalAndSave() {
  const char *mid = p_module.getValue();
  const char *tok = p_token.getValue();
  const char *u = p_url.getValue();
  if (mid && mid[0]) strlcpy(g_cfg.moduleId, mid, sizeof(g_cfg.moduleId));
  if (tok && tok[0]) strlcpy(g_cfg.apiKey, tok, sizeof(g_cfg.apiKey));
  if (u && strncmp(u, "https://", 8) == 0 && strstr(u, "/functions/v1/")) {
    strlcpy(g_cfg.apiUrl, u, sizeof(g_cfg.apiUrl));
  }
  saveConfig();
}

static bool connectSavedWifi(unsigned long timeoutMs) {
  WiFi.mode(WIFI_STA);
  WiFi.setAutoReconnect(true);
  WiFi.persistent(true);
  if (WiFi.SSID().length() == 0) return false;
  WiFi.disconnect(false);
  delay(100);
  WiFi.begin();
  unsigned long t0 = millis();
  while (WiFi.status() != WL_CONNECTED && millis() - t0 < timeoutMs) {
    delay(250);
    yield();
    esp_task_wdt_reset();
  }
  if (WiFi.status() == WL_CONNECTED) {
    pushFlash(FP_WIFI);
    g_prevWifiConnected = true;
    return true;
  }
  return false;
}

static void runConfigPortal() {
  portalWdtRelax(true);
  g_portalRunning = true;
  g_portalSaveRequested = false;
  wm.stopConfigPortal();
  WiFi.persistent(true);
  WiFi.disconnect(true, false);
  delay(200);
  WiFi.mode(WIFI_AP_STA);
  wm.setBreakAfterConfig(true);
  wm.setConfigPortalTimeout(PORTAL_TIMEOUT_SEC);
  wm.setConfigPortalBlocking(true);
  wm.setConnectTimeout(45);
  wm.setSaveConnectTimeout(45);
  wm.setMinimumSignalQuality(-1);
  modoTexto = true;
  texto = "WIFI PRO400-SETUP 192.168.4.1 ";
  scrollPos = 0;
  prepararTexto();
  Serial.println(F("[WiFi] Portal PRO400-Setup"));
  wm.startConfigPortal(AP_NAME);
  if (g_portalSaveRequested) copyPortalAndSave();
  wm.stopConfigPortal();
  WiFi.softAPdisconnect(true);
  g_portalRunning = false;
  portalWdtRelax(false);
  if (WiFi.status() != WL_CONNECTED) connectSavedWifi(30000UL);
  if (WiFi.status() == WL_CONNECTED) pushFlash(FP_WIFI);
  else if (g_uiMode == UI_NORMAL) modoTexto = false;
}

static void setupWifi() {
  WiFi.setSleep(false);
  WiFi.persistent(true);
  wm.setSaveConfigCallback([]() { g_portalSaveRequested = true; });
  p_module.setValue(g_cfg.moduleId, sizeof(g_cfg.moduleId) - 1);
  p_token.setValue(g_cfg.apiKey, sizeof(g_cfg.apiKey) - 1);
  p_url.setValue(g_cfg.apiUrl, sizeof(g_cfg.apiUrl) - 1);
  wm.addParameter(&p_module);
  wm.addParameter(&p_token);
  wm.addParameter(&p_url);

  if (digitalRead(PIN_FORCE_PORTAL) == LOW ||
      strlen(g_cfg.moduleId) == 0 || strlen(g_cfg.apiKey) == 0) {
    runConfigPortal();
    return;
  }
  if (!connectSavedWifi(WIFI_BOOT_CONNECT_MS)) g_prevWifiConnected = false;
}

static String paramsUrl() {
  String u(g_cfg.apiUrl);
  int idx = u.lastIndexOf("/ingest-reading");
  if (idx > 0) {
    u.remove(idx);
    u += "/fetch-pro400-params";
    return u;
  }
  idx = u.lastIndexOf('/');
  if (idx > 0) {
    u.remove(idx);
    u += "/fetch-pro400-params";
  }
  return u;
}

static void pullParamsFromCloud() {
  if (P.F20 >= 1.0f) return;
  if (WiFi.status() != WL_CONNECTED) return;
  if (!g_cfg.moduleId[0] || !g_cfg.apiKey[0]) return;

  const String url = paramsUrl();
  if (url.length() == 0) return;

  HTTPClient http;
  http.setTimeout(8000);
  if (!http.begin(url)) return;
  http.addHeader("Content-Type", "application/json");

  StaticJsonDocument<200> req;
  req["moduleId"] = g_cfg.moduleId;
  req["deviceToken"] = g_cfg.apiKey;
  String body;
  serializeJson(req, body);

  const int code = http.POST(body);
  const String resp = http.getString();
  http.end();
  if (code != 200) {
    Serial.printf("[PULL] HTTP %d\n", code);
    return;
  }

  StaticJsonDocument<2048> doc;
  if (deserializeJson(doc, resp)) return;

  const char *upd = doc["updated_at"] | "";
  if (upd[0] && g_paramsUpdatedAt == upd) return;

  JsonVariant pv = doc["params"];
  JsonObject obj = pv.is<JsonObject>() ? pv.as<JsonObject>() : doc.as<JsonObject>();
  if (obj.isNull() || obj.size() == 0) {
    if (upd[0]) g_paramsUpdatedAt = String(upd);
    return;
  }

  g_paramsUpdatedAt = String(upd);
  applyParamsFromJson(obj);
  syncTelemetryInterval();
  saveParams(obj);
  Serial.printf("[PULL] OK %d claves updated_at=%s\n", (int)obj.size(), upd);
  pushFlash(FP_PARAM);
}

static const char *phaseToJson(Phase p) {
  switch (p) {
    case PH_BOOT:    return "boot";
    case PH_NORMAL:  return "normal";
    case PH_DEFROST: return "defrost";
    case PH_DRIP:    return "drip";
    case PH_EMERG:   return "emerg";
    case PH_OFF:     return "off";
    default:         return "normal";
  }
}

static void enviarTelemetria() {
  if (P.F21 < 1.0f || P.F20 >= 2.0f) return;
  if (WiFi.status() != WL_CONNECTED) return;
  if (!g_cfg.moduleId[0] || !g_cfg.apiKey[0]) return;

  pushFlash(FP_ENVIANDO);
  HTTPClient http;
  http.setTimeout(8000);
  http.begin(g_cfg.apiUrl);
  http.addHeader("Content-Type", "application/json");

  const uint32_t elapsedS = (uint32_t)((millis() - g_phaseStartedAt) / 1000UL);
  String body = "{";
  body += "\"moduleId\":\"" + String(g_cfg.moduleId) + "\",";
  body += "\"deviceToken\":\"" + String(g_cfg.apiKey) + "\",";
  if (!fault1) body += "\"temp1_c\":" + String(tCam, 2) + ",";
  else body += "\"temp1_c\":null,";
  body += "\"comp_on\":" + String(compresor ? "true" : "false") + ",";
  body += "\"fan_on\":" + String(ventilador ? "true" : "false") + ",";
  body += "\"defrost_on\":" + String(deshielo ? "true" : "false") + ",";
  body += "\"phase\":\"" + String(phaseToJson(g_phase)) + "\",";
  body += "\"phase_elapsed_s\":" + String(elapsedS) + ",";
  body += "\"phase_total_s\":" + String(g_phaseTotalS);
  if (g_paramsUpdatedAt.length() > 0) {
    body += ",\"params_updated_at\":\"" + g_paramsUpdatedAt + "\"";
  }
  body += "}";

  const int code = http.POST(body);
  const String resp = http.getString();
  Serial.printf("[TX] POST %d\n", code);
  http.end();
  if (code != 200) return;

  pushFlash(FP_ENVIADO);

  StaticJsonDocument<384> rx;
  if (deserializeJson(rx, resp) == DeserializationError::Ok) {
    const char *pu = rx["params_updated_at"] | "";
    if (pu[0] && g_paramsUpdatedAt != pu) g_pullNowRequested = true;
    if (rx["pull_params_now"] | false) g_pullNowRequested = true;
  }
}

static void requestImmediateTx() {
  g_immediateTxRequested = true;
}

static void checkTelemetryTriggers() {
  if (compresor != prevCompresor) {
    requestImmediateTx();
    prevCompresor = compresor;
  }
  if (P.F24 >= 0.5f) {
    if (ventilador != prevVentilador || deshielo != prevDeshielo) {
      requestImmediateTx();
    }
  }
  prevVentilador = ventilador;
  prevDeshielo = deshielo;

  if (!fault1 && P.F23 > 0.0f && prevTempReported > -100.0f) {
    if (fabsf(tCam - prevTempReported) >= P.F23) requestImmediateTx();
  }
  if (!fault1 && prevTempReported <= -100.0f) prevTempReported = tCam;
  else if (!fault1) prevTempReported = tCam;
}

static void leerSerial() {
  if (!Serial.available()) return;
  String s = Serial.readStringUntil('\n');
  s.trim();
  String lower = s;
  lower.toLowerCase();
  if (lower == "portal" || lower == "wifi") runConfigPortal();
  else if (lower == "temp") {
    modoTexto = false;
    g_normalDisp = DISP_TEMP;
    refreshNormalDisplay();
    return;
  } else if (lower == "ntc" || lower == "adc") {
    printNtcDiag();
    return;
  } else if (lower == "btns" || lower == "buttons" || lower == "btn") {
    printBtnDiag();
    return;
  } else if (lower == "pull") g_pullNowRequested = true;
  else if (lower == "config") {
    Serial.printf("module=%s sp=%.1f diff=%.1f F09=%.0f F22=%.0f\n",
                  g_cfg.moduleId, P.F01, P.F05, P.F09, P.F22);
  } else if (lower == "off") {
    compresor = ventilador = deshielo = false;
    dripping = false;
    flashUiMessage("OFF ", 900);
  } else if (lower == "defrost" || lower == "deshielo") {
    g_serialForceDefrost = true;
    Serial.println(F("[SERIE] Deshielo en proximo tick"));
  } else if (s.length() > 0) {
    flashUiMessage(s.c_str(), 1200);
  }
}

static void displayTask(void *param) {
  SPI.beginTransaction(SPISettings(1000000, MSBFIRST, SPI_MODE0));
  for (;;) {
    refrescarDisplay();
    vTaskDelay(pdMS_TO_TICKS(1));
  }
}

static void networkTask(void *param) {
  esp_task_wdt_add(NULL);
  unsigned long lastTel = 0;
  unsigned long lastPull = 0;
  unsigned long lastRetry = 0;
  for (;;) {
    esp_task_wdt_reset();
    if (!g_portalRunning && WiFi.status() == WL_CONNECTED) {
      if (!g_prevWifiConnected) {
        g_prevWifiConnected = true;
        pushFlash(FP_WIFI);
      }
      const unsigned long now = millis();
      bool sendNow = false;
      unsigned long telEvery = g_cfg.intervalMs;
      if (temperatureRead() >= CHIP_TEMP_WARN_C) telEvery = max(telEvery, 120000UL);
      if (now - lastTel >= telEvery) sendNow = true;
      if (g_immediateTxRequested) {
        const bool gapOk = (g_lastImmediateTxAt == 0) ||
                           (now - g_lastImmediateTxAt >= IMMEDIATE_TX_MIN_GAP_MS);
        if (gapOk) {
          sendNow = true;
          g_immediateTxRequested = false;
          g_lastImmediateTxAt = now;
        }
      }
      if (sendNow) {
        lastTel = now;
        enviarTelemetria();
      }
      if (g_pullNowRequested || now - lastPull >= PARAMS_PULL_MS) {
        lastPull = now;
        g_pullNowRequested = false;
        pullParamsFromCloud();
      }
    } else if (!g_portalRunning && WiFi.status() != WL_CONNECTED) {
      g_prevWifiConnected = false;
      if (lastRetry == 0 || millis() - lastRetry >= 30000UL) {
        lastRetry = millis();
        WiFi.disconnect(false);
        WiFi.begin();
      }
    }
    vTaskDelay(pdMS_TO_TICKS(200));
  }
}

void setup() {
  Serial.begin(115200);
  pinMode(STROBE_PIN, OUTPUT);
  digitalWrite(STROBE_PIN, LOW);
  pinMode(PIN_FORCE_PORTAL, INPUT_PULLUP);
  initBtnPin(BTN_UP_PIN);
  initBtnPin(BTN_DOWN_PIN);
  initBtnPin(BTN_SET_PIN);
  initBtnPin(BTN_BACK_PIN);
  if (DOOR_PIN >= 0) initBtnPin(DOOR_PIN);
  syncBtnPrevFromPins();
  printBtnDiag();
  analogReadResolution(12);
  analogSetPinAttenuation(NTC1_PIN, ADC_11db);

