arturo9218/S.G-REPRESENTACIONES1/firmware/esp32_pro400_cd4094/esp32_pro400_cd4094.ino
  SPI.begin(CLOCK_PIN, -1, DATA_PIN, -1);
  SPI.beginTransaction(SPISettings(1000000, MSBFIRST, SPI_MODE0));
  enviar4094(comunesApagados(), 0xFF);
  SPI.endTransaction();

  Serial.println(F("AR Monitoreo PRO400 booteando..."));
  ensureFs();
  loadConfig();
  loadParams();
  syncTelemetryInterval();

#if defined(ESP_IDF_VERSION_MAJOR) && ESP_IDF_VERSION_MAJOR >= 5
  esp_task_wdt_config_t twdt = { .timeout_ms = 30000, .idle_core_mask = 0, .trigger_panic = true };
  if (esp_task_wdt_init(&twdt) == ESP_ERR_INVALID_STATE) esp_task_wdt_reconfigure(&twdt);
#else
  esp_task_wdt_init(30, true);
#endif
  esp_task_wdt_add(NULL);

  bootAtMs = millis();
  unsigned long holdMs = (unsigned long)(P.F13 * 60.0f * 1000.0f);
  if (holdMs < RELAY_BOOT_MIN_MS) holdMs = RELAY_BOOT_MIN_MS;
  relaySafeUntilMs = bootAtMs + holdMs;
  if (P.F19 > 0.0f) keysLockUntilMs = bootAtMs + (unsigned long)(P.F19 * 1000.0f);

  bootDelayDone = false;
  defrostOnStartDone = false;
  firstCompCycleDone = false;
  emergencyChangedAt = bootAtMs;
  compChangedAt = bootAtMs;
  lastDefrostEndAt = bootAtMs;

  texto = "BOOT";
  prepararTexto();

  xTaskCreatePinnedToCore(displayTask, "disp", 2048, NULL, 2, &g_displayTaskHandle, 1);
  setupWifi();
  if (!g_portalRunning && g_uiMode == UI_NORMAL) modoTexto = false;
  xTaskCreatePinnedToCore(networkTask, "net", 8192, NULL, 1, &g_netTaskHandle, 0);
}

void loop() {
  esp_task_wdt_reset();
  leerSerial();
  leerPuerta();
  handleButtonUi();
  serviceUiFlash(millis());

  if (millis() - lastReadAt >= 1000) {
    lastReadAt = millis();
    bool raw = false;
    const float rawT = leerNTCRaw(raw);
    applyEma(rawT);
    updateFault(raw);
    aplicarControl();
    checkTelemetryTriggers();
    aplicarDeratingCalor(millis());
    if (g_ntcBootDiagPending && millis() - bootAtMs >= 4000UL) {
      g_ntcBootDiagPending = false;
      Serial.println(F("---- Diagnostico NTC al arranque (4 s) ----"));
      printNtcDiag();
    }
  }

  if (g_uiMode == UI_PARAM_SELECT) {
    showParamCodeOnDisplay(g_paramMenu[g_paramCursor].code);
  } else if (g_uiMode == UI_PARAM_EDIT) {
    mostrarTemperatura(*g_paramMenu[g_paramCursor].value);
  } else if (!modoTexto && !g_flashActive && millis() - lastDisplaySwitchAt >= 1000) {
    lastDisplaySwitchAt = millis();
    refreshNormalDisplay();
  }
}
